Revit 2027 API
BuiltInFailures.RebarBendingDetailFailures Class
 Failures concerning rebar bending details.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.RebarBendingDetailFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class RebarBendingDetailFailures
Public NotInheritable Class RebarBendingDetailFailures
public ref class RebarBendingDetailFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RebarBendingDetailFailures = class end
The BuiltInFailures.RebarBendingDetailFailures type exposes the following members.
Properties
Name | Description
RemoveBendingDetailWithInvalidRebarElement |  The reinforcement element is no longer supporting bending details. The associated bending detail elements have been deleted.
Top
See Also
Reference
Autodesk.Revit.DB Namespace